# 5. Написать программу вычисления значения функции y = f(a) "y=2*a+17"
a = int(input('a = '))
print(f'y =  2 * {a} + 17 = ', 2 * a + 17)