# 2. Даны два числа. Показать большее и меньшее число

a = int(input('a = '))
b = int(input('b = '))
#if (a > b):
#    print('{} - большее, {} - меньшее'.format(a, b))
#else:
#    print('{} - большее, {} - меньшее'.format(b, a))
print(max(a, b))