#29. Написать программу вычисления произведения чисел от 1 до N
n = int(input("N = "))
res = 1
for i in range(1, n+1):
    res *= i
print(res)

import math
print(math.factorial(int(input())))


